Revit 2026 API

# TemperatureRatingTypeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TemperatureRatingTypeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
TemperatureRatingTypeSetIterator()
```
```fsharp
new : unit -> TemperatureRatingTypeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

TemperatureRatingTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace